# -*- coding: utf-8 -*-

# 用来辅助调整截图区域坐标

import cv2

capture_pos = [(414, 804, 1041, 59),    # 玩家区域
               (530, 470, 380, 160),    # 玩家上家区域
               (1010, 470, 380, 160),   # 玩家下家区域
               (1320, 300, 110, 140),   # 地主标志区域(玩家上家)
               (320, 720, 110, 140),    # 地主标志区域(玩家)
               (500, 300, 110, 140),    # 地主标志区域(玩家下家)
               (817, 36, 287, 136)      # 地主底牌区域
               ]

# capture_pos = [#(414, 804, 1041, 59),    # 玩家区域
#                 (1320, 300, 110, 140),   # 地主标志区域(玩家上家)
#                (320, 720, 110, 140),    # 地主标志区域(玩家)
# (500, 300, 110, 140),    # 地主标志区域(玩家下家)
#                # (817, 36, 287, 136)      # 地主底牌区域
#                ]
img_path = './back.jpg'


img = cv2.imread(img_path)
for pos in capture_pos:
    img = cv2.rectangle(img, pos[0:2], (pos[0] + pos[2], pos[1] + pos[3]), (0, 0, 255), 3)
cv2.namedWindow("demo", 0)
cv2.imshow("demo", img)
cv2.waitKey(0)
cv2.destroyAllWindows()
